productblog/app/controllers/home_controller.rb

  def index
  		@users = User.all
  		@orders = Order.all
---
SELECT "users".* FROM "users"
SELECT "orders".* FROM "orders"