productblog/app/controllers/orders_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
  def new

          @order = Order.new
          @users = User.all

INSERT INTO "orders" ("order_no", "tracking_no", "is_express_delivery", "is_customer_pickup", "dilivery_date", "order_currency", "special_instruction", "order_value", "user_id", "address_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save