productblog/app/views/home/index.html.erb

SELECT "orders".* FROM "orders"
---
<tr>
<td><%= link_to order.order_no, order %></td>