productblog/app/views/orders/show.html.erb

    <dt>First Name:</dt>
    <dd><%= @order.user.first_name %></dd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]

    <dt>Country:</dt>
    <dd><%= @order.address.country %></dd>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]

 <h3 align="center">Line Items</h3>
 <% @order.lineitems.each do |item| %>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."order_id" = ?  [["order_id", 6]]